// let arr = [12,9,21,54,36,18];
// let max = arr[0];
// for(let i = 0; i < arr.length; i++) {
//     if(arr[i] > max){
//         max = arr[i];
//     }
//     // else continue;
//     console.log(max);
// }
// console.log(max);

// function arrSort(a, b){
//     if(a>b) return 1;
//     if(a<b) return -1;
//     if(a==b) return 0;
// }
// arr.sort(arrSort);

// console.log(arr[arr.length - 1]);

// 1. Есть два массива, которые пользователь задает сам. Вам нужно объеденить данные массивы в один
// 2. Дается массив. Переверните его.
// 3. Дается строка состоящяя из одного большего слова. Разделите данное слово по буквам и сделайте из него массив
// 4. Дается массив из букв может и цифр. Сделайте из этого массива одно слово. Клей должен быть одним из (; ","; "."; "/")